using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Daykouka : MonoBehaviour
{
    // Start is called before the first frame update
    void Start()
    {

    }

    // Update is called once per frame
    void Update()
    {

    }
    // Dictionary<string, int[]> dic3 = ,new  Dictionary<string, int[]>();
    public static Dictionary<string, int[]> ItemDictionary = new Dictionary<string, int[]>
    {
        //{"アイテム名",new  int [2] {ポイント,アイテム分類}}
        //アイテム分類
        //0 ゴールアイテム
        //1 食料品
        //2 その他(分類待ち)
        {"ゴール",                new int [2]{15,0 }},
        {"大トロ",                new int [2]{5,1 }},
        {"牛タン",                new int [2]{5,1 }},
        {"プリン",                new int [2]{2,1 }},
        {"ハンバーガー",          new int [2]{3,1 }},
        {"記念硬貨",              new int [2]{7,2 }},
        {"真珠",                  new int [2]{4,2 }},
        {"メロン",                new int [2]{4,1 }},
        {"ガトーショコラ",        new int [2]{3,1 }},
        {"八尺球",                new int [2]{3,2 }},
        {"無線機",                new int [2]{5,2 }},
        {"ビキニ",                new int [2]{4,2 }},
        {"トランジスタ",          new int [2]{5,2 }},
        {"石炭",                  new int [2]{3,2 }},
        {"短冊",                  new int [2]{7,2 }},
        {"下駄",                  new int [2]{2,2 }},
        {"梅干し",                new int [2]{1,1 }},
        {"生肉",                  new int [2]{3,1 }},
        {"ジンベイザメの人形",    new int [2]{6,2 }},
        {"タコの足",              new int [2]{1,1 }},
        {"マンゴー",              new int [2]{2,1 }},
        {"ウクレレ",              new int [2]{3,2 }},
        {"ハイエイトチョコ",      new int [2]{2,1 }},
        {"ハッピー",              new int [2]{5,2 }},
        {"和菓子を入手",          new int [2]{3,1 }},
        {"チキン南蛮",            new int [2]{2,1 }},
        {"駅弁",                  new int [2]{2,1 }},
        {"国連のパンフレット",    new int [2]{5,2 }},
        {"チキンラーメン",        new int [2]{2,1 }},
        {"くるみパン",            new int [2]{2,1 }},
        {"さつま揚げ",            new int [2]{2,1 }},
        {"ジェットコースター",    new int [2]{5,2 }},
        {"帽子",                  new int [2]{3,2 }},
        {"信号機",                new int [2]{3,2 }},
        {"レインボーブリッジ",    new int [2]{1,2 }},
        {"傘",                    new int [2]{3,2 }},
        {"寿司",                  new int [2]{5,1 }},
        {"はっぴ",                new int [2]{5,2 }},
        {"山",                    new int [2]{9,2 }},
        {"パンツ",                new int [2]{1,2 }},
        {"ジェラート",            new int [2]{3,1 }},
        {"勾玉",                  new int [2]{6,2 }},
        {"オリンピックの記念品",  new int [2]{5,2 }},
        {"平和な心",              new int [2]{8,2 }},
        {"怪談話集",              new int [2]{4,2 }},
        {"金シャチ",              new int [2]{4,2 }},
        {"ベートーヴェンのズラ",  new int [2]{2,2 }},
        {"手羽先",                new int [2]{3,1 }},
        {"加須の手打ちうどん",    new int [2]{4,1 }},
        {"おもちゃ花火",          new int [2]{4,2 }},
        {"ラジオ放送",            new int [2]{8,2 }},
        {"ポテチ",                new int [2]{3,2 }},
        {"ロールケーキ",          new int [2]{3,1 }},
        {"ペパーミント",          new int [2]{1,1 }},
        {"パフェ",                new int [2]{3,1 }},
        {"パパ",                  new int [2]{1,2 }},
        {"パイナップル",          new int [2]{3,1 }},
        {"お小遣い",              new int [2]{3,2 }},
        {"記念ボール",            new int [2]{7,2 }},
        {"えびフライ",            new int [2]{3,1 }},
        {"キウイ",                new int [2]{3,1 }},
        {"紅葉",                  new int [2]{5,2 }},
        {"地蔵",                  new int [2]{5,2 }},
        {"日本列島",              new int [2]{8,2 }},
        {"高いベッド",            new int [2]{8,2 }},
        {"畳",                    new int [2]{2,2 }},
        {"パソコン",              new int [2]{3,2 }},
        {"落ち葉",                new int [2]{1,2 }},
        {"佃煮",                  new int [2]{2,1 }},
        {"東京タワーのストラップ",new int [2]{4,2 }},
        {"やさい",                new int [2]{2,1 }},
        {"緑黄色野菜",            new int [2]{3,1 }},
        {"緑黄色野菜+",           new int [2]{5,1 }},
        {"ショートケーキ",        new int [2]{3,1 }},
        {"イチゴ",                new int [2]{1,1 }},
        {"イチゴ+",               new int [2]{15,1}},
        {"宅配ピザ",              new int [2]{5,1 }},
        {"カブトムシ",            new int [2]{3,2 }},
        {"ヘラクレスオオカブト",  new int [2]{10,2}},
        {"暑中見舞いの品",        new int [2]{3,1 }},
        {"かき氷",                new int [2]{3,1 }},
        {"資格",                  new int [2]{9,2 }},
        {"スクラップ",            new int [2]{1,2 }},
        {"カトラリーセット",      new int [2]{5,2 }},
        {"クレジットカード",      new int [2]{7,2 }},

    };



    public static Dictionary<string, string[,]> DayEffectictDictionary = new Dictionary<string, string[,]>
    {
      /*
       * 
      {日付,new string[,]{
                     1つ目の効果   { 記念日, 効果の種類,手に入るアイテムや変更するBGMの名前 },
                     2つ目の効果   {"クレジットの日","アイテム" ,"クレジットカード"}
       }},
    　 
      効果の種類について
      　手に入るアイテムや変化するBGMが示せるもの
       　アイテム　       アイテムが手に入るだけのもの
    　　 アイコン　       アイコンが変わる
    　　 BGM　　　　      BGMが変わる
       　背景             背景が変わる
         背景とBGM        背景とBGMを変える
       　アイテム変換　   アイテムが置き換わる
         配置             スモッグ
         消滅             ノストラダムス
      　その他　　分類不可　記念日ごとの変数作成が望まれるもの

      */

        {"6/1",new string[,]{//ダイスを振って奇数なら資格を入手
                                { "資格チャレンジの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/2",new string[,]{//誰かと自分のマスを交換してもよい。
                                { "裏切りの日", "裏切り", "裏切り" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/3",new string[,]{
                                { "くるみパンの日", "アイテム", "くるみパン" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/4",new string[,]{//1~5ならカブトムシを入手3pt6ならヘラクレスオオカブトを入手10pt
                                { "虫の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/5",new string[,]{//効果なし
                                { "環境の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/6",new string[,]{
                                { "ロールケーキの日", "アイテム", "ロールケーキ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/7",new string[,]{//効果なし
                                { "ムダ毛なしの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/8",new string[,]{
                                { "世界海洋デー", "アイテム", "ジンベイザメの人形" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/9",new string[,]{
                                { "まがたまの日", "アイテム", "勾玉" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/10",new string[,]{//好きな日に移動する。（移動したマスの効果は発動しないものとする）
                                { "時の記念日", "時", "時" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/11",new string[,]{
                                { "傘の日", "アイテム", "傘" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/12",new string[,]{//誰かと同じマスに移動する。
                                { "恋人の日", "恋人", "恋人" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/13",new string[,]{//強い肉体を手に入れる。次のターン、ダイスの出目を二倍にする
                                { "鉄人の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/14",new string[,]{
                                { "手羽先記念日", "アイテム", "手羽先" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/15",new string[,]{//6月にいる人全員が暑中見舞いの品を入手3pt
                                { "暑中見舞いの日", "暑中見舞い", "暑中見舞い" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/16",new string[,]{
                                { "和菓子の日", "アイテム", "和菓子" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/17",new string[,]{
                                { "薩摩の日", "アイテム", "さつま揚げ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/18",new string[,]{
                                { "国際寿司の日", "アイテム", "寿司" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/19",new string[,]{
                                { "ベースボール記念日", "アイテム", "記念ボール" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/20",new string[,]{
                                { "ペパーミントの日", "アイテム", "ペパーミント" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/21",new string[,]{
                                { "えびフライの日", "アイテム", "えびフライ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/22",new string[,]{//効果なし
                                { "DHAの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/23",new string[,]{
                                { "オリンピックデー", "アイテム", "オリンピックの記念品" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/24",new string[,]{//UFOに乗る好きな月の24日に移動する。
                                { "UFOの日", "UFO", "UFO" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/25",new string[,]{
                                { "加須市うどんの日", "アイテム", "加須の手打ちうどん" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/26",new string[,]{//次のターン、ダイスの出目を二倍にする。
                                { "露天風呂記念日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/27",new string[,]{//全プレイヤーがこのマスに集まる。
                                { "演説の日", "演説", "演説" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/28",new string[,]{
                                { "パフェの日", "アイテム", "パフェ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/29",new string[,]{
                                { "佃煮の日", "アイテム", "佃煮" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"6/30",new string[,]{
                                { "トランジスタの日", "アイテム", "トランジスタ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},



        { "7/1",new string[,]{//持ってる金属製アイテムが一つスクラップになるスクラップ：ポイント＋１
                                {"鉄スクラップの日", "アイテム変換", "スクラップ" },
                                //{"クレジットの日","アイテム" ,"クレジットカード"}
        }},
        {"7/2",new string[,]{
                                { "タコの日", "アイテム", "タコの足" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/3",new string[,]{//波に押し流される右横に3マス進む
                                { "波の日", "波", "波" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/4",new string[,]{
                                { "独立記念日", "アイテム", "記念硬貨" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/5",new string[,]{//アイコンがビキニになるビキニを一つ入手＋4ポイント
                                { "ビキニスタイルの日", "アイコン", "ビキニ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/6",new string[,]{//BGMがピアノ風になる
                                { "ピアノの日", "BGM", "ピアノ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/7",new string[,]{
                                { "七夕", "アイテム", "短冊" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/8",new string[,]{
                                { "チキン南蛮の日", "アイテム", "チキン南蛮" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/9",new string[,]{
                                { "ジェットコースターの日", "アイテム", "ジェットコースター" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/10",new string[,]{
                                { "国土建設記念日", "アイテム", "日本列島" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/11",new string[,]{
                                { "真珠記念日", "アイテム", "真珠" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/12",new string[,]{//カトラリーセットを手に入れる＋５ポイント食料アイテムを1つ食べてしまった！
                                { "洋食器の日", "アイテム変換", "カトラリーセット" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/13",new string[,]{//BGMがホラー調にムー大陸が出現する
                                { "オカルト記念日", "背景とBGM", "ムー大陸" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/14",new string[,]{
                                { "パリ祭り", "アイテム", "八尺球" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/15",new string[,]{
                                { "マンゴーの日", "アイテム", "マンゴー" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/16",new string[,]{
                                { "駅弁記念日", "アイテム", "駅弁" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/17",new string[,]{
                                { "東京の日", "背景", "東京タワーのストラップ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/18",new string[,]{
                                { "光化学スモッグ", "配置", "スモッグ" },//スモッグ
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/19",new string[,]{//次の月の同日にテレポート
                                { "パリメトロ一号開通", "パリメトロ", "パリメトロ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/20",new string[,]{//アイコンがビキニなら、アイコンを戻してよい
                                { "Tシャツの日", "アイコン", "Tシャツ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/21",new string[,]{//まだない
                                { "", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/22",new string[,]{
                                { "下駄の日", "アイテム", "下駄" },//ショートケーキか下駄
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/23",new string[,]{//まだない
                                { "", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/24",new string[,]{
                                { "地蔵会の日", "アイテム", "地蔵"},
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/25",new string[,]{//かき氷を手に入れる（次のターンで７．８月にいた場合、かき氷は消失）
                                { "かき氷の日", "アイテム", "かき氷" },//特殊アイテム
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/26",new string[,]{//アイコンが幽霊になる
                                { "幽霊の日", "アイコン", "幽霊" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/27",new string[,]{//7月が消滅する
                                { "ノストラダムスの大予言", "消滅", "ノストラダムス" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/28",new string[,]{//まだない
                                { "", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/29",new string[,]{
                                { "アマチュア無線の日", "アイテム", "無線機" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/30",new string[,]{
                                { "梅干しの日", "アイテム", "梅干し" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"7/31",new string[,]{
                                { "", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},


        {"8/1",new string[,]{
                                { "はっぴの日", "アイテム", "はっぴ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/2",new string[,]{//次のターンダイスの目＋2
                                { "おやつの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/3",new string[,]{//次のターン３．４．５が出るダイスを振れる
                                { "みたらし団子の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/4",new string[,]{//１～６のダイスを振り出たポイントを得る
                                { "パチスロの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/5",new string[,]{//次のターン5マスまで自由なマスに止まれる
                                { "タクシーの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/6",new string[,]{
                                { "平和記念日", "アイテム", "平和な心" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/7",new string[,]{
                                { "おもちゃ花火の日", "アイテム", "おもちゃ花火" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/8",new string[,]{
                                { "パパの日", "アイテム", "パパ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/9",new string[,]{
                                { "長崎平和の日", "アイテム", "平和の心" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/10",new string[,]{
                                { "ハットの日", "アイテム", "帽子" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/11",new string[,]{
                                { "山の日", "アイテム", "山" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/12",new string[,]{//全員に使用するとダイスの出目+1
                                { "配布の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/13",new string[,]{
                                { "怪談の日", "アイテム", "怪談話集" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/14",new string[,]{//足をつる次のターン１～３のダイスを振る
                                { "水泳の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/15",new string[,]{
                                { "終戦記念日", "アイテム", "ラジオ放送" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/16",new string[,]{//次のターンマグロになる一直線にしか進めない
                                { "トロの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/17",new string[,]{
                                { "パイナップルの日", "アイテム", "パイナップル" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/18",new string[,]{//なにもない
                                { "", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/19",new string[,]{
                                { "世界人道デー", "アイテム", "国連のパンフレット" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/20",new string[,]{
                                { "交通信号設置記念日", "アイテム", "信号機" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/21",new string[,]{
                                { "イージーパンツの日", "アイテム", "パンツ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/22",new string[,]{
                                { "金シャチの日", "アイテム", "金シャチ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/23",new string[,]{
                                { "湖池屋ポテトチップスの日", "アイテム", "ポテチ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/24",new string[,]{
                                { "ドレッシングの日", "アイテム", "やさい" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/25",new string[,]{
                                { "即席ラーメン記念日", "アイテム", "チキンラーメン" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/26",new string[,]{
                                { "レインボーブリッジ開通記念日", "アイテム", "レインボーブリッジ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/27",new string[,]{
                                { "ジェラートの日", "アイテム", "ジェラート" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/28",new string[,]{
                                { "ヴァイオリンの日", "アイテム", "ベートーヴェンのズラ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/29",new string[,]{
                                { "焼肉の日", "アイテム", "生肉" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/30",new string[,]{
                                { "ハッピーサンシャインデー", "アイテム", "ハッピー" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"8/31",new string[,]{//緑黄色野菜を食べる+3pt(8月24日が空いていたら5pt)
                                { "野菜の日", "野菜", "野菜" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/1",new string[,]{
                                { "キウイの日", "アイテム", "キウイ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/2",new string[,]{//さいころを振る出た目の数×３ポイント
                                { "宝くじの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/3",new string[,]{
                                { "ベッドの日", "アイテム", "高いベッド" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/4",new string[,]{//最後に獲得したポイント（ゴール以外で）の2点につき1ポイント獲得
                                { "オークションの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/5",new string[,]{
                                { "石炭の日", "アイテム", "石炭" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/6",new string[,]{
                                { "メロンの日", "アイテム", "メロン" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/7",new string[,]{//次のターンが終わるまで受ける効果を無効にしてもよい
                                { "クリーナーの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/8",new string[,]{//改変求む
                                { "休養の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/9",new string[,]{//改変求む
                                { "温泉の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/10",new string[,]{
                                { "牛タンの日", "アイテム", "牛タン" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/11",new string[,]{//他にめん料理が出ていれば3ポイント獲得
                                { "めんの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/12",new string[,]{//次のターン追加で2マスまで進んでもよい
                                { "マラソンの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/13",new string[,]{
                                { "お父さんの日", "アイテム", "お小遣い" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/14",new string[,]{//女性から別れを切り出す日だそうですアイテム一つ失う
                                { "セプテンバーバレンタイン", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/15",new string[,]{//イチゴを獲得1ポイントゴールを達成していなかったら代わりに15ポイント
                                { "イチゴの日", "イチゴ", "イチゴ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/16",new string[,]{
                                { "トロの日", "アイテム", "大トロ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/17",new string[,]{//1ポイント獲得次のターンさいころを2回振る
                                { "モノレール開業記念日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/18",new string[,]{//カイワレ大根を獲得このゲームで自分のターンが終了するごとに1ポイント獲得
                                { "カイワレ大根の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/19",new string[,]{//次のターン1~3マスしか動けない
                                { "敬老の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/20",new string[,]{//1マス好きな方向に動く
                                { "バスの日", "バス", "バス" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/21",new string[,]{
                                { "ガトーショコラの日", "アイテム", "ガトーショコラ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/22",new string[,]{//ショートケーキを獲得3ポイント15日が開いていたら15日に移動して効果を使う
                                { "ショートケーキの日", "ケーキ", "ケーキ" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/23",new string[,]{
                                { "秋分の日", "アイテム", "紅葉" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/24",new string[,]{
                                { "畳の日", "アイテム", "畳" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/25",new string[,]{
                                { "プリンの日", "アイテム", "プリン" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/26",new string[,]{//改変求む
                                { "風呂の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/27",new string[,]{//好きなワープポイントに移動できる
                                { "世界観光の日", "世界観光", "世界観光" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/28",new string[,]{
                                { "パソコンの日", "アイテム", "パソコン" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/29",new string[,]{//次に誰かがポイントを獲得したとき（ゴールは除く）そのポイントと同じポイントをもらう
                                { "招き猫の日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
        {"9/30",new string[,]{//次のターンさいころを2回振れる次に誰かと同じマスに止まった時宅配ピザを獲得7ポイント獲得２ｄ６
                                { "宅配ピザの日", "", "" },
                                //{"うどんの日","アイテム" ,"生めん"}
        }},
    };



    public void DectionariyInfoA(string Item)
    {

        Debug.Log(ItemDictionary[Item][0]);
        //  return ItemDictionary["Item"];

    }




    /* 書き方がダメだった奴　正しくは、 {"大トロ",new  int [2]{5,1 } },とする
        Dictionary<string, int[]> ItemDictionary = new  Dictionary<string, int[]>
        {

            {"大トロ", int{5,1 } },
            /*

        };
    */




}
